package ru.kimdo;

/**
 * 1) Создать массив с набором слов (20-30 слов, должны встречаться повторяющиеся):
 * а. Посчитать сколько раз встречается каждое слово;
 * б. Найти список слов, из которых состоит текст (дубликаты не считать);
 * 2) Написать простой класс ТелефонныйСправочник:
 * а. В каждой записи всего три поля: Фамилия, Телефон, email;
 * б. Отдельный метод для поиска номера телефона по фамилии (ввели фамилию, получили 
 * телефон), и отдельный метод для поиска email по фамилии. Следует учесть, что под
 * одной фамилией может быть несколько записей.
 */

public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
